Revit 2027 API
BaseImportOptions.SetDefaultLengthUnit Method
 Set the default length unit used for importing unitless files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDefaultLengthUnit(
	ForgeTypeId specTypeId
)
Public Sub SetDefaultLengthUnit (
	specTypeId As ForgeTypeId
)
public:
void SetDefaultLengthUnit(
	ForgeTypeId^ specTypeId
)
member SetDefaultLengthUnit :
        specTypeId : ForgeTypeId -> unit
Parameters
specTypeId ForgeTypeId
 The default length unit.
Exceptions
Exception | Condition
ArgumentException |  The given specTypeId is not a supported unit of length.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace